/*
Copyright 2026 Dennis Michael Heine

Licensed under the Apache License, Version 2.0 (the "License");
you may not use this file except in compliance with the License
You may obtain a copy of the License at

http://www.apache.org/licenses/LICENSE-2.0

Unless required by applicable law or agreed to in writing, software
distributed under the License is distributed on an "AS IS" BASIS,
WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied
See the License for the specific language governing permissions and
limitations under the License
*/

/*
 * MBR Guardian v2.0 - Graphical UEFI Boot Manager
 *
 * Features:
 *  - Graphical tile-based boot menu with mouse + keyboard
 *  - Automatic MBR change detection and snapshotting
 *  - Customizable icons per entry (BMP files on ESP)
 *  - CSM legacy chainloading of saved MBR states
 */

#include <efi.h>
#include <efilib.h>
#include <efidevp.h>
#include <protocol/legacyboot.h>
#include "gfx.h"
#include "font8x16.h"

/* ------------------------------------------------------------------ */
/*  MBR Constants and Structures                                       */
/* ------------------------------------------------------------------ */

#define MBR_SIZE            512
#ifndef MBR_SIGNATURE
#define MBR_SIGNATURE       0xAA55
#endif
#define SNAPSHOT_DIR        L"\\EFI\\mbr-guardian\\snapshots"
#define ICON_DIR            L"\\EFI\\mbr-guardian\\icons"
#define CONFIG_DIR          L"\\EFI\\mbr-guardian"
#define MAX_SNAPSHOTS       32
#define MAX_DISKS           16
#define MAX_UEFI_ENTRIES    32
#define LABEL_MAX           64
#define PATH_MAX            256

#define SNAP_MAGIC          0x4742524D  /* 'MBRG' */

typedef struct {
    UINT32  magic;
    UINT32  version;
    UINT32  disk_index;
    UINT32  mbr_hash;
    CHAR16  label[LABEL_MAX];
    CHAR16  icon_file[PATH_MAX];    /* Custom icon BMP path */
    EFI_TIME timestamp;
    UINT8   mbr[MBR_SIZE];
} MBR_SNAPSHOT;

typedef struct {
    UINTN           count;
    MBR_SNAPSHOT    entries[MAX_SNAPSHOTS];
    CHAR16          filenames[MAX_SNAPSHOTS][PATH_MAX];
    ICON_IMAGE      *icons[MAX_SNAPSHOTS];
} SNAPSHOT_LIST;

typedef struct {
    EFI_BLOCK_IO_PROTOCOL   *block_io;
    EFI_HANDLE              handle;
    UINT32                  disk_id;
} DISK_ENTRY;

typedef struct {
    UINT16      boot_num;               /* Boot#### number */
    CHAR16      description[LABEL_MAX]; /* Display name */
    CHAR16      path[PATH_MAX];         /* EFI file path (if available) */
    BOOLEAN     active;                 /* LOAD_OPTION_ACTIVE */
    ICON_IMAGE  *icon;
} UEFI_BOOT_ENTRY;

typedef struct {
    UINTN           count;
    UEFI_BOOT_ENTRY entries[MAX_UEFI_ENTRIES];
} UEFI_BOOT_LIST;

/* ------------------------------------------------------------------ */
/*  Globals                                                            */
/* ------------------------------------------------------------------ */

/* gST, gBS are provided by gnu-efi's efilib.h as macros (gST→ST, gBS→BS).
 * gRT is the runtime services macro. We alias gRS→gRT for this project.
 * LibImageHandle is gnu-efi's image handle; alias gImageHandle to it. */
#define gRS                 gRT
#define gImageHandle        LibImageHandle
extern EFI_HANDLE           LibImageHandle;

/* PI-spec EFI_LEGACY_BIOS_PROTOCOL (modern CSM firmware uses this GUID
   instead of the old Intel LEGACY_BOOT_PROTOCOL). */
static EFI_GUID gEfiLegacyBiosProtocolGuid =
    { 0xdb9a1e3d, 0x45cb, 0x4abb,
      { 0x85, 0x3b, 0xe5, 0x38, 0x7f, 0xdb, 0x2e, 0x2d } };

typedef EFI_STATUS (EFIAPI *PI_LEGACY_BIOS_BOOT)(
    IN void                 *This,
    IN BBS_BBS_DEVICE_PATH  *BootOption,
    IN UINT32                LoadOptionsSize,
    IN void                 *LoadOptions
);

typedef EFI_STATUS (EFIAPI *PI_LEGACY_BIOS_INT86)(
    IN void     *This,
    IN UINT8     BiosInt,
    IN OUT void *Regs
);

typedef EFI_STATUS (EFIAPI *PI_LEGACY_BIOS_GET_BBS_INFO)(
    IN  void     *This,
    OUT UINT16   *HddCount,
    OUT void    **HddInfo,
    OUT UINT16   *BbsCount,
    OUT void    **BbsTable
);

typedef EFI_STATUS (EFIAPI *PI_LEGACY_BIOS_PREPARE_TO_BOOT)(
    IN  void     *This,
    OUT UINT16   *BbsCount,
    OUT void    **BbsTable
);

typedef struct {
    PI_LEGACY_BIOS_INT86          Int86;                  /* 0 */
    void                         *FarCall86;              /* 1 */
    void                         *CheckPciRom;            /* 2 */
    void                         *InstallPciRom;          /* 3 */
    PI_LEGACY_BIOS_BOOT           LegacyBoot;             /* 4 */
    void                         *UpdateKeyboardLedStatus;/* 5 */
    PI_LEGACY_BIOS_GET_BBS_INFO   GetBbsInfo;             /* 6 */
    void                         *ShadowAllLegacyOproms;  /* 7 */
    PI_LEGACY_BIOS_PREPARE_TO_BOOT PrepareToBootEfi;      /* 8 */
} PI_LEGACY_BIOS_PROTOCOL;

/* PI BBS table entry (packed per PI spec Vol 5, Appendix A).
   Total size = 67 bytes (0x00..0x42). */
#pragma pack(1)
typedef struct {
    UINT16  BootPriority;       /* 0x00 */
    UINT32  Bus;                /* 0x02 */
    UINT32  Device;             /* 0x06 */
    UINT32  Function;           /* 0x0A */
    UINT8   Class;              /* 0x0E */
    UINT8   SubClass;           /* 0x0F */
    UINT16  MfgStringOffset;    /* 0x10 */
    UINT16  MfgStringSegment;   /* 0x12 */
    UINT16  DeviceType;         /* 0x14 */
    UINT16  StatusFlags;        /* 0x16 */
    UINT16  BootHandlerOffset;  /* 0x18 */
    UINT16  BootHandlerSegment; /* 0x1A */
    UINT16  DescStringOffset;   /* 0x1C */
    UINT16  DescStringSegment;  /* 0x1E */
    UINT32  InitPerReserved;    /* 0x20 */
    UINT16  AdditionalIrq13;    /* 0x24..0x2D */
    UINT8   _pad1[8];
    UINT16  AdditionalIrq18;    /* 0x2E..0x37 */
    UINT8   _pad2[8];
    UINT16  AdditionalIrq19;    /* 0x38..0x41 */
    UINT8   _pad3[8];
    UINT8   IBV1;               /* 0x42 */
} PI_BBS_ENTRY;                 /* 67 bytes */
#pragma pack()
#define PI_BBS_IGNORE   0xFFFF
#define PI_BBS_LOW_PRIO 0xFFFE

/* Minimal register set for PI Int86 (x86 registers, zeroed for INT 19h) */
typedef struct {
    UINT32  EAX, EBX, ECX, EDX, ESI, EDI;
    UINT16  EFlags;
    UINT16  ES, CS, SS, DS, FS, GS;
    UINT32  EBP, ESP;
} PI_IA32_REGISTER_SET;

static DISK_ENTRY           gDisks[MAX_DISKS];
static UINTN                gDiskCount = 0;

static SNAPSHOT_LIST        gSnaps;
static UEFI_BOOT_LIST       gUefiBoot;
static EFI_FILE_PROTOCOL    *gRootDir = NULL;

/* UI state */
static TILE                 gTiles[MAX_TILES];
static UINTN                gTileCount = 0;
static INT32                gSelectedTile = -1;
static INT32                gScrollY = 0;

/* Status message */
static CHAR16               gStatusMsg[128] = L"Ready";

/* Debug marker GUID: 5f0a6f09-7bf0-4b3d-9206-bdc7ca57f8c1 */
